{
    "ads": [
        {
            "id": 0,
            "name": "Cámara clásica Nikon F3",
            "userId": 1,
            "price": 350,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/Nikon_F3.png",
            "tags": [
                "work",
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "Increíble oportunidad para adquirir esta joya vintage: la cámara clásica Nikon F3. Perfecta para aquellos que buscan capturar momentos únicos con estilo y elegancia. Con su diseño icónico y su durabilidad, esta cámara es una compañera fiel en cualquier aventura fotográfica. Estado: bueno."
        },
        {
            "id": 1,
            "name": "Pensamiento profundo",
            "userId": 1,
            "price": 42,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/42.png",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Compra",
            "description": "Una creación asombrosa de los Magratheans, este dispositivo de inteligencia artificial redefine nuestra comprensión del universo. Equipado con una capacidad de cálculo incomparable, se sumerge en la esencia misma del cosmos en busca de respuestas. Capaz de descifrar la verdad sobre la vida, el universo y todo lo demás."
        },
        {
            "id": 2,
            "name": "Teléfono móvil Nokia 3310",
            "userId": 2,
            "price": 50,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/nokia_3310.jpg",
            "tags": [
                "mobile",
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Clásico Nokia 3310 disponible para los nostálgicos! Con su diseño resistente y su batería de larga duración, este teléfono es perfecto como pieza de colección o como dispositivo secundario. Revive la era pre-smartphone con este icono de la telefonía móvil. Estado: para piezas."
        },
        {
            "id": 3,
            "name": "Moto vintage - Harley-Davidson Sportster",
            "userId": 1,
            "price": 12000,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/harley_davidson_sportster.jpg",
            "tags": [
                "motor",
                "lifestyle"
            ],
            "buysell": "Compra",
            "description": "¡Adquiere esta legendaria Harley-Davidson Sportster y emprende la aventura en la carretera! Con su estilo vintage y su potente motor, esta moto es perfecta para aquellos que buscan libertad y emoción sobre dos ruedas. Ideal para coleccionistas y amantes de las motos clásicas. Estado: bueno."
        },
        {
            "id": 4,
            "name": "Consola clásica Nintendo (NES)",
            "userId": 1,
            "price": 200,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/nes.jpg",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Revive la nostalgia de los videojuegos con esta consola clásica Nintendo (NES)! Perfecta para aquellos que quieren disfrutar de los mejores juegos retro. Con su diseño icónico y su amplio catálogo de títulos, garantiza diversión para toda la familia. Estado: bueno."
        },
        {
            "id": 5,
            "name": "Coche clásico - Volkswagen Beetle",
            "userId": 1,
            "price": 15000,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/volkswagen_beetle.jpg",
            "tags": [
                "motor",
                "lifestyle"
            ],
            "buysell": "Compra",
            "description": "¡Hazte con este emblemático Volkswagen Beetle y destaca en la carretera! Con su estilo retro y su fiabilidad, este coche clásico es perfecto para aquellos que buscan un toque de nostalgia en sus viajes. Ideal para coleccionistas y amantes de los coches vintage. Estado: bueno."
        },
        {
            "id": 6,
            "name": "Juego Super Mario Bros",
            "userId": 1,
            "price": 30,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/super_mario_bros.jpg",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Clásico juego Super Mario Bros disponible para los amantes de la nostalgia! Sumérgete en el mundo de Mario y rescata a la princesa Peach en esta aventura llena de diversión. Perfecto para revivir los momentos de la infancia y disfrutar de la magia de los videojuegos retro. Estado: bueno."
        },
        {
            "id": 7,
            "name": "Cámara clásica Leica M3",
            "userId": 1,
            "price": 1200,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/leica_m3.jpg",
            "tags": [
                "work",
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡No te pierdas esta oportunidad de poseer la icónica cámara Leica M3! Conocida por su calidad y su precisión, esta cámara es perfecta para capturar momentos únicos con elegancia. Ideal para profesionales y aficionados que buscan lo mejor en fotografía. Estado: bueno."
        },
        {
            "id": 8,
            "name": "Moto legendaria - Honda CB750",
            "userId": 1,
            "price": 8000,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/honda_cb750.jpg",
            "tags": [
                "motor",
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Hazte con esta legendaria Honda CB750 y domina la carretera con estilo! Con su diseño clásico y su rendimiento excepcional, esta moto es perfecta para aquellos que buscan aventuras sobre dos ruedas. Ideal para coleccionistas y amantes de las motos vintage. Estado: bueno."
        },
        {
            "id": 9,
            "name": "Teléfono móvil Motorola Razr V3",
            "userId": 2,
            "price": 80,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/motorola_razr_v3.jpg",
            "tags": [
                "mobile",
                "lifestyle"
            ],
            "buysell": "Compra",
            "description": "Teléfono móvil Motorola Razr V3 disponible. Diseñado para aquellos que buscan un dispositivo elegante y funcional para su vida diaria. Con su diseño delgado y su pantalla externa, ofrece una experiencia de comunicación sofisticada. Ideal como teléfono secundario o para aquellos que valoran el estilo retro. Estado: para piezas."
        },
        {
            "id": 10,
            "name": "Consola clásica Atari 2600",
            "userId": 1,
            "price": 100,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/atari_2600.jpg",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Disfruta de la nostalgia con esta consola clásica Atari 2600! Perfecta para aquellos que quieren revivir la época dorada de los videojuegos. Con su amplio catálogo de juegos retro, garantiza horas de entretenimiento para toda la familia. Estado: bueno."
        },
        {
            "id": 11,
            "name": "Coche clásico - Chevrolet Camaro",
            "userId": 2,
            "price": 25000,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/chevrolet_camaro.jpg",
            "tags": [
                "motor",
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Adquiere este impresionante Chevrolet Camaro y destaca en cualquier carretera! Con su potente motor y su diseño atemporal, este coche clásico es una verdadera obra maestra del automovilismo. Ideal para coleccionistas o para aquellos que buscan un toque de estilo retro en sus paseos. Estado: para restaurar."
        },
        {
            "id": 12,
            "name": "Juego Pac-Man PS1",
            "userId": 1,
            "price": 20,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/pacman.jpg",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Revive la diversión de los arcades con este clásico juego Pac-Man para PlayStation 1! Perfecto para aquellos que quieren disfrutar de horas de entretenimiento retro en su consola. Atrévete a superar los laberintos y come todos los puntos para ganar. Estado: bueno."
        },
        {
            "id": 13,
            "name": "Cámara clásica Canon AE-1",
            "userId": 1,
            "price": 250,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/canon_ae1.jpg",
            "tags": [
                "work",
                "lifestyle"
            ],
            "buysell": "Compra",
            "description": "¡No te pierdas esta oportunidad de poseer una cámara clásica Canon AE-1! Conocida por su fiabilidad y su facilidad de uso, esta cámara es perfecta tanto para profesionales como para aficionados. Captura momentos únicos con su calidad de imagen excepcional y su diseño icónico. Estado: bueno."
        },
        {
            "id": 14,
            "name": "Teléfono móvil BlackBerry Curve 8520",
            "userId": 2,
            "price": 40,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/blackberry_curve_8520.jpg",
            "tags": [
                "mobile",
                "work"
            ],
            "buysell": "Compra",
            "description": "Teléfono móvil BlackBerry Curve 8520 disponible. Diseñado para profesionales que buscan un dispositivo confiable para su trabajo diario. Con su teclado físico y su plataforma segura, ofrece una experiencia de comunicación eficiente. Ideal para aquellos que valoran la productividad en movimiento. Estado: para piezas."
        },
        {
            "id": 15,
            "name": "Moto vintage - Triumph Bonneville",
            "userId": 2,
            "price": 10000,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/triumph_bonneville.jpg",
            "tags": [
                "motor",
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Disfruta de la auténtica experiencia retro con esta Triumph Bonneville! Con su estilo clásico y su motor potente, esta moto es perfecta para aquellos que buscan aventuras en la carretera con un toque vintage. Ideal para coleccionistas o para quienes quieren destacar en cualquier ruta. Estado: para restaurar."
        },
        {
            "id": 16,
            "name": "Consola clásica Sega Mega Drive (Genesis)",
            "userId": 1,
            "price": 150,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/sega_mega_drive.jpg",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Revive la emoción de los años 90 con esta consola clásica Sega Mega Drive (Genesis)! Perfecta para aquellos que quieren disfrutar de los mejores juegos retro de SEGA. Con su amplio catálogo de títulos y su diseño icónico, garantiza horas de diversión para toda la familia. Estado: bueno."
        },
        {
            "id": 17,
            "name": "Juego The Legend of Zelda",
            "userId": 1,
            "price": 40,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/legend_of_zelda.jpg",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Embárcate en una épica aventura con el juego The Legend of Zelda! Perfecto para aquellos que buscan sumergirse en un mundo de fantasía y acción. Ayuda a Link a salvar a la princesa Zelda y a derrotar al malvado Ganon en este clásico de los videojuegos. Estado: bueno."
        },
        {
            "id": 18,
            "name": "Cámara clásica Pentax K1000",
            "userId": 1,
            "price": 180,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/pentax_k1000.jpg",
            "tags": [
                "work",
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡No te pierdas esta oportunidad de tener una cámara clásica Pentax K1000! Conocida por su fiabilidad y su facilidad de uso, es perfecta para fotógrafos de todos los niveles. Captura momentos únicos con su calidad de imagen excepcional y su diseño resistente. Ideal para profesionales y aficionados por igual. Estado: bueno."
        },
        {
            "id": 19,
            "name": "Teléfono móvil Sony Ericsson T10s",
            "userId": 2,
            "price": 35,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/sony_ericsson_t10s.jpg",
            "tags": [
                "mobile",
                "lifestyle"
            ],
            "buysell": "Compra",
            "description": "Teléfono móvil Sony Ericsson T10s disponible. Diseñado para aquellos que buscan un dispositivo compacto y confiable para su vida diaria. Con su diseño elegante y su interfaz intuitiva, ofrece una experiencia de comunicación sin complicaciones. Ideal como teléfono secundario o para aquellos que prefieren lo simple. Estado: para piezas."
        },
        {
            "id": 20,
            "name": "Consola clásica Super Nintendo(SNES)",
            "userId": 1,
            "price": 180,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/snes.jpg",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Revive la magia de los 90 con esta consola clásica Super Nintendo (SNES)! Perfecta para aquellos que quieren disfrutar de los mejores juegos retro de Nintendo. Con su innovador controlador y su impresionante catálogo de títulos, garantiza diversión para todas las edades. Estado: bueno."
        },
        {
            "id": 21,
            "name": "Juego Tetris",
            "userId": 1,
            "price": 15,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/tetris.jpg",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Clásico juego Tetris disponible para desafiar tu habilidad y tu mente! Perfecto para aquellos que buscan un desafío divertido y adictivo. Ordena los bloques y completa líneas para acumular puntos en este juego atemporal. Estado: bueno."
        },
        {
            "id": 22,
            "name": "Cámara clásica Minolta X-700",
            "userId": 1,
            "price": 300,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/minolta_x700.jpg",
            "tags": [
                "work",
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡No te pierdas esta oportunidad de tener una cámara clásica Minolta X-700! Con su avanzada tecnología y su diseño elegante, es perfecta para fotógrafos exigentes. Captura imágenes impresionantes con su calidad de imagen excepcional y su facilidad de uso. Ideal para profesionales y aficionados por igual. Estado: bueno."
        },
        {
            "id": 23,
            "name": "Teléfono móvil Siemens S55",
            "userId": 2,
            "price": 25,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/siemens_s55.jpg",
            "tags": [
                "mobile",
                "work"
            ],
            "buysell": "Venta",
            "description": "Teléfono móvil clásico Siemens S55 disponible. Diseñado para profesionales que buscan un dispositivo compacto y funcional para su vida laboral. Con su interfaz intuitiva y su durabilidad, garantiza una comunicación eficiente en todo momento. Ideal como teléfono secundario o para aquellos que valoran la simplicidad. Estado: para piezas."
        },
        {
            "id": 24,
            "name": "Consola clásica PlayStation 1 (PS1)",
            "userId": 1,
            "price": 120,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/ps1.jpg",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Revive la emoción de los 90 con esta consola clásica PlayStation 1 (PS1)! Perfecta para aquellos que quieren disfrutar de los mejores juegos retro de Sony. Con su impresionante catálogo de títulos y su diseño icónico, garantiza horas de diversión para toda la familia. Estado: bueno."
        },
        {
            "id": 25,
            "name": "Juego Sonic the Hedgehog (Mega Drive)",
            "userId": 1,
            "price": 25,
            "photo": "https://raw.githubusercontent.com/Santiagomadaw/practicaNodeJS/main/public/images/sonic_the_hedgehog.jpg",
            "tags": [
                "lifestyle"
            ],
            "buysell": "Venta",
            "description": "¡Acelera con el juego Sonic the Hedgehog para Mega Drive! Perfecto para aquellos que quieren experimentar la velocidad y la emoción de Sonic en su consola retro. Recorre coloridos mundos y derrota al malvado Dr. Robotnik en esta aventura clásica. Estado: bueno."
        }
    ],
    "users": []
}